'''b=['red','yellow','green','blue','orange','purple']
import turtle as t
t.speed(100)
for i in range(200):
    t.right(61)
    t.pencolor(b[i%6])
    t.fd(i)'''



yee={'姓名':'杨嘉诚','年龄':12,'爱好':['活着','是人']}

#print(yee['姓名'])



'''yee.update({'年龄':100})



yee.pop('姓名')
print(yee)'''

b=[]
a={"星期一":["数学","语文","英语","历史","美术","体育","例会"],
"星期二":["语文","语文","英语","历史","体育","例会"],
"星期三":["数学","语文","语文","电脑","体育","例会"],
"星期四":["数学","道法","英语","历史","美术","体育"],
"星期五":["数学","语文","数学","道法","美术","美术"]}
c=input('星期几')
b=a[c]
d=input('第几节课(数字)')
d=int(d)
f=d-1
print(b[f])
